xfire-core/src/test/org/codehaus/xfire/addressing/testcases/echo/soap12/duplicateFaultToRequest.xml

<?xml version='1.0' ?>
<!-- $Id$ -->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"
                 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <soap12:Header>
  <wsa:Action>http://example.org/action/echoIn</wsa:Action>
  <wsa:MessageID>http://message.id/test</wsa:MessageID>
  <wsa:FaultTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
  </wsa:FaultTo>
  <wsa:FaultTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
  </wsa:FaultTo>
 </soap12:Header>
 <soap12:Body>
  <m:echo xmlns:m="http://example.org/echo">Echo This Text</m:echo>
 </soap12:Body>
</soap12:Envelope>
